# Nashville Scooter Data pt4, joining the data

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import pickle
%matplotlib inline

In [2]:
may = pd.read_csv('../data/may.csv')
may = may.sort_values('companyname')

In [3]:
may.head(1)

,pubdatetime,latitude,longitude,sumdid,sumdtype,chargelevel,sumdgroup,costpermin,companyname
0,2019-05-01 00:01:41.247000,36.136822,-86.799877,PoweredLIRL1,Powered,93.0,scooter,0.0,Bird

In [4]:
may.tail(1)

,pubdatetime,latitude,longitude,sumdid,sumdtype,chargelevel,sumdgroup,costpermin,companyname
10146251,2019-05-20 19:42:33.423000,36.15853,-86.78045,Powered5484396,Powered,99.0,Scooter,0.0,Spin

In [5]:
may.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 20292503 entries, 0 to 10146251
Data columns (total 9 columns):
 #   Column       Dtype
---  ------       -----
 0   pubdatetime  object
 1   latitude     float64
 2   longitude    float64
 3   sumdid       object
 4   sumdtype     object
 5   chargelevel  float64
 6   sumdgroup    object
 7   costpermin   float64
 8   companyname  object
dtypes: float64(4), object(5)
memory usage: 1.5+ GB

In [6]:
may_companies = list(enumerate(may.companyname.unique()))
may_companies

[(0, 'Bird'),
 (1, 'Bolt'),
 (2, 'Gotcha'),
 (3, 'Jump'),
 (4, 'Lime'),
 (5, 'Lyft'),
 (6, 'Spin')]

In [7]:
june = pd.read_csv('../data/june.csv')
june = june.sort_values('companyname')

In [8]:
june.head(1)

,pubdatetime,latitude,longitude,sumdid,sumdtype,chargelevel,sumdgroup,costpermin,companyname
23539555,2019-06-26 04:32:37.147000,36.160294,-86.778396,PoweredDIGLD,Powered,70.0,scooter,0.15,Bird

In [9]:
june.tail(1)

,pubdatetime,latitude,longitude,sumdid,sumdtype,chargelevel,sumdgroup,costpermin,companyname
13530961,2019-06-15 04:40:43.647000,36.15163,-86.804928,Powered4987498,Powered,57.0,Scooter,0.23,Spin

In [10]:
june.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 28046095 entries, 23539555 to 13530961
Data columns (total 9 columns):
 #   Column       Dtype
---  ------       -----
 0   pubdatetime  object
 1   latitude     float64
 2   longitude    float64
 3   sumdid       object
 4   sumdtype     object
 5   chargelevel  float64
 6   sumdgroup    object
 7   costpermin   float64
 8   companyname  object
dtypes: float64(4), object(5)
memory usage: 2.1+ GB

In [11]:
june_companies = list(enumerate(june.companyname.unique()))
june_companies

[(0, 'Bird'),
 (1, 'Bolt'),
 (2, 'Gotcha'),
 (3, 'Jump'),
 (4, 'Lime'),
 (5, 'Lyft'),
 (6, 'Spin')]

In [12]:
july = pd.read_csv('../data/july.csv')
july = july.sort_values('companyname')

In [13]:
july.head(1)

,pubdatetime,latitude,longitude,sumdid,sumdtype,chargelevel,sumdgroup,costpermin,companyname
18106104,2019-07-22 23:52:06.760000,36.173757,-86.784629,PoweredJALW3,Powered,100.0,scooter,0.15,Bird

In [14]:
july.tail(1)

,pubdatetime,latitude,longitude,sumdid,sumdtype,chargelevel,sumdgroup,costpermin,companyname
21590775,2019-07-27 15:02:59.907000,36.15261,-86.79329,Powered1897818,Powered,84.0,Scooter,0.23,Spin

In [15]:
july.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 25075445 entries, 18106104 to 21590775
Data columns (total 9 columns):
 #   Column       Dtype
---  ------       -----
 0   pubdatetime  object
 1   latitude     float64
 2   longitude    float64
 3   sumdid       object
 4   sumdtype     object
 5   chargelevel  float64
 6   sumdgroup    object
 7   costpermin   float64
 8   companyname  object
dtypes: float64(4), object(5)
memory usage: 1.9+ GB

In [16]:
july_companies = list(enumerate(july.companyname.unique()))
july_companies

[(0, 'Bird'),
 (1, 'Bolt'),
 (2, 'Gotcha'),
 (3, 'Jump'),
 (4, 'Lime'),
 (5, 'Lyft'),
 (6, 'Spin')]